



    




<!DOCTYPE HTML>

<html>
    <head>
        <script type="application/ld+json">
    {
        "@context" : "http://schema.org",
        "@type" : "BlogPosting",
        "mainEntityOfPage": {
             "@type": "WebPage",
             "@id": "https:\/\/minayu.site"
        },
        "articleSection" : "blog",
        "name" : "[Back-end Tech] Research on Amazon Neptune Database and Data Visualization",
        "headline" : "[Back-end Tech] Research on Amazon Neptune Database and Data Visualization",
        "description" : "Graph DB, AWS Neptune and Data Visualization is the topic I collaborate with member from another team in our company\u0027s innovative idea research sprint, this will be a funny and innovative experience for me. I would like to extract part of our research note here.",
        "inLanguage" : "en",
        "author" : "",
        "creator" : "",
        "publisher": "",
        "accountablePerson" : "",
        "copyrightHolder" : "",
        "copyrightYear" : "2022",
        "datePublished": "2022-12-16 22:37:20 \u002b0800 CST",
        "dateModified" : "2022-12-16 22:37:20 \u002b0800 CST",
        "url" : "https:\/\/minayu.site\/en\/2022\/12\/research-on-graph-database-and-its-visualization-with-neptune\/",
        "wordCount" : "2286",
        "keywords" : [ "Amazon Neptune","Graph Database","G.V()","Gremlin","Data Visualization","Personal Website", "個人網站"]
    }
    </script>
        
            <title>[Back-end Tech] Research on Amazon Neptune Database and Data Visualization - @Mina Influence</title>
        

        <meta charset="utf-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1" />
        <meta name="generator" content="Hugo 0.104.0" />
        


  
    
    
  

  

  <link rel="icon" href='/img/favicon.jpg'>




        
            <meta name="author" content="minayu416">
        
        
            <meta name="description" content="Graph DB, AWS Neptune and Data Visualization is the topic I collaborate with member from another team in our company&#39;s innovative idea research sprint, this will be a funny and innovative experience for me. I would like to extract part of our research note here.">
        

        <meta name="robots" content="index,follow">

        <meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="[Back-end Tech] Research on Amazon Neptune Database and Data Visualization"/>
<meta name="twitter:description" content="Graph DB, AWS Neptune and Data Visualization is the topic I collaborate with member from another team in our company&#39;s innovative idea research sprint, this will be a funny and innovative experience for me. I would like to extract part of our research note here."/>

        
        <meta name="twitter:image" content="https://minayu.site/img/cover-image.jpeg">
        <meta property="og:title" content="[Back-end Tech] Research on Amazon Neptune Database and Data Visualization" />
<meta property="og:description" content="Graph DB, AWS Neptune and Data Visualization is the topic I collaborate with member from another team in our company&#39;s innovative idea research sprint, this will be a funny and innovative experience for me. I would like to extract part of our research note here." />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://minayu.site/en/2022/12/research-on-graph-database-and-its-visualization-with-neptune/" /><meta property="article:section" content="blog" />
<meta property="article:published_time" content="2022-12-16T22:37:20+08:00" />
<meta property="article:modified_time" content="2022-12-16T22:37:20+08:00" /><meta property="og:site_name" content="@Mina Influence" />


        <meta property="og:image" content="https://minayu.site/img/cover-image.jpeg">
        <meta property="og:image:type" content="image/jpg">
        <meta property="og:image:width" content="1200">
        <meta property="og:image:height" content="630">
        
        
        <meta itemprop="name" content="[Back-end Tech] Research on Amazon Neptune Database and Data Visualization">
<meta itemprop="description" content="Graph DB, AWS Neptune and Data Visualization is the topic I collaborate with member from another team in our company&#39;s innovative idea research sprint, this will be a funny and innovative experience for me. I would like to extract part of our research note here."><meta itemprop="datePublished" content="2022-12-16T22:37:20+08:00" />
<meta itemprop="dateModified" content="2022-12-16T22:37:20+08:00" />
<meta itemprop="wordCount" content="2286">
<meta itemprop="keywords" content="Amazon Neptune,Graph Database,G.V(),Gremlin,Data Visualization," />

        
            
        

        <link rel="stylesheet" href="/js/main.js">
        
        <link rel="stylesheet" href="/css/style.css">
        <script type="text/javascript" src="/js/carousel.js"></script>
        <link rel="stylesheet" href="/css/carousel.css">

        <script async src="//busuanzi.ibruce.info/busuanzi/2.3/busuanzi.pure.mini.js"></script>

        
        

        

      
      
<script type="application/javascript">
var doNotTrack = false;
if (!doNotTrack) {
	(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
	(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
	m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
	})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
	ga('create', 'UA-129499146-2', 'auto');
	
	ga('send', 'pageview');
}
</script>
      
      
      
<script async src="https://www.googletagmanager.com/gtag/js?id=G-EETGWC7GNV"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'G-EETGWC7GNV');
</script>
      
    </head>
    <body>


  <div>
    <header>
    <div class="max-auto">
  <div class="mx-auto flex flex-wrap border-b border-solid">
    <div class="lg:w-1/2 w-full lg: h-full object-cover object-center bg-cover">
      <div class="w-full h-full">
      <div class="relative overflow-hidden">
          <img class="object-cover w-full header-image-size" src="/img/blog-cover-image.jpg" alt="Blog Cover Image"/>
        <div>
            <nav>
    <div class="absolute top-0 left-0 px-2 py-2 z-10 header-navbar">
        
        <div class="px-6">
        <div class="mx-auto">
            <div class="flex">
            <div class="flex space-x-4">
                <div class="hidden md:flex items-center space-x-1 header-navbar-menu">
                
                    <a href="/en/about/" class="py-4 px-3">About</a>
                
                    <a href="/en/" class="py-4 px-3">Home</a>
                
                    <a href="/en/blog/" class="py-4 px-3">Blog</a>
                
                    <a href="/en/portfolio/" class="py-4 px-3">Portfolio</a>
                
                    <a href="/en/contact/" class="py-4 px-3">Contact</a>
                
                </div>
            </div>

            <div class="md:hidden flex items-center">
                <button onclick="menuToggle();" class="pt-4 px-2">
                <svg xmlns="http://www.w3.org/2000/svg" class="h-6 w-6 text-white" fill="none" viewBox="0 0 24 24" stroke="currentColor" stroke-width="2">
    <path stroke-linecap="round" stroke-linejoin="round" d="M4 6h16M4 12h16M4 18h16" /></svg>
                </button>
            </div>
            </div>
        </div>
        </div>

        
        <div id="mobile-menu" class="md:hidden absolute w-full rounded header-mobile-menu hidden">
            
            <a href="/en/about/" class="block py-3 px-4">About</a>
            
            <a href="/en/" class="block py-3 px-4">Home</a>
            
            <a href="/en/blog/" class="block py-3 px-4">Blog</a>
            
            <a href="/en/portfolio/" class="block py-3 px-4">Portfolio</a>
            
            <a href="/en/contact/" class="block py-3 px-4">Contact</a>
            

            <div class="block py-3 px-4">
                <a href="#" lang="en" class="py-4 px-2">EN</a>
                /
                
                    <a href="https://minayu.site/2022/12/research-on-graph-database-and-its-visualization-with-neptune/" lang="zh-tw" class="py-4 px-2">中文</a>
                  
                
            </div>
        </div>
    </div>

    <div class="absolute top-0 right-0 px-2 py-2 z-10">
        <div class="px-6">
        <div class="mx-auto">
            <div class="flex">
            <div class="flex space-x-4">
                <div class="hidden md:flex items-center space-x-1 header-navbar-menu">
                    <a href="#" lang="en" class="py-4 px-2">EN</a>
                    
                        <a href="https://minayu.site/2022/12/research-on-graph-database-and-its-visualization-with-neptune/" lang="zh-tw" class="py-4 px-2">中文</a>
                      
                    
                </div>
            </div>
            </div>
        </div>
        </div>
    </div>
    </nav>

    <script>
      var x = document.getElementById("mobile-menu");
      function menuToggle(){
        if (x.classList.item(x.classList.length - 1) != "hidden"){
          x.classList.add("hidden");
        } else {
          x.classList.remove("hidden");
        }

      }

    </script>
          <div class="absolute px-2 py-2 site-branding">
            <div class="site-title">
              <p><a href="https://minayu.site/en">@Mina Influence</a></p>
            </div>
              <div class="site-description">
              <p>Inspire you to have New thinking, Walk out your unique Road.</p>
            </div>
            </div>

          </div>
        </div>
    </div>
    </div>

    <div class="grid justify-items-center lg:w-1/2 w-full lg:h-auto lg:py-6 mt-6 lg:mt-0">
      <div class="blog-branding-intro motto-block">
        
        <section class="text-gray-500 body-font">
          <div class="container px-6 mx-auto">
            <div class="w-full mx-auto text-center">
              <svg xmlns="http://www.w3.org/2000/svg" fill="currentColor" class="inline-block w-6 h-6 text-gray-400 mb-4" viewBox="0 0 975.036 975.036">
                <path d="M925.036 57.197h-304c-27.6 0-50 22.4-50 50v304c0 27.601 22.4 50 50 50h145.5c-1.9 79.601-20.4 143.3-55.4 191.2-27.6 37.8-69.399 69.1-125.3 93.8-25.7 11.3-36.8 41.7-24.8 67.101l36 76c11.6 24.399 40.3 35.1 65.1 24.399 66.2-28.6 122.101-64.8 167.7-108.8 55.601-53.7 93.7-114.3 114.3-181.9 20.601-67.6 30.9-159.8 30.9-276.8v-239c0-27.599-22.401-50-50-50zM106.036 913.497c65.4-28.5 121-64.699 166.9-108.6 56.1-53.7 94.4-114.1 115-181.2 20.6-67.1 30.899-159.6 30.899-277.5v-239c0-27.6-22.399-50-50-50h-304c-27.6 0-50 22.4-50 50v304c0 27.601 22.4 50 50 50h145.5c-1.9 79.601-20.4 143.3-55.4 191.2-27.6 37.8-69.4 69.1-125.3 93.8-25.7 11.3-36.8 41.7-24.8 67.101l35.9 75.8c11.601 24.399 40.501 35.2 65.301 24.399z"></path>
              </svg>
              <p class="leading-relaxed">
                Sometimes, you just meet some stories and invoked your inspiration, then later you use a totally different way, different concept to have a different life in the future.
                </p>
              <span class="inline-block h-1 w-10 rounded bg-pink-500 mt-8 mb-6"></span>
              <h2 class="text-gray-900 font-medium title-font tracking-wider text-lg">Sign @MinaYu.</h2>
            </div>
          </div>
        </section>
      </div> 
    </div>
  </div>
</div>
</header>
   
    <section class="text-gray-600 body-font">
    <div class="container py-12 mx-auto">
        
        
        <div class="flex-wrap">
        <div class="p-2">
          <div class="mx-auto flex flex-wrap bg-white">
            <div class="lg:w-2/3 w-full lg: h-full object-cover object-center bg-cover">
              <div class="px-4">
  
              <div class="mb-10 border border-solid py-4">
                
                
                
                
                    <p class="text-center tracking-widest text-md font-medium post-category font-fondamento">IT Things and Development</p>
                
                
                
                
                
                    <h3 class="text-center tracking-widest text-md font-medium post-category font-fondamento">[Back-end] 10000 hours - Plan of being Back-end Developer</h3>
                
                
                
              

                <p class="font-bold text-center text-gray grid-subtitle text-md font-fondamento px-4 pt-2 pb-2">[Back-end Tech] Research on Amazon Neptune Database and Data Visualization</p>
                
                
                <p class="text-center test-gray italic tracking-wider font-mario">Posted on 
                  <time class="published" datetime='2022-12-16'>
                    Dec 16, 2022</time>
                </p>
              </div>
  
              
              
              <div class="flex-wrap">
                
                
            
                
                    
                    







  

                    
                    
                    
            
                    <a href="/en/2022/12/research-on-graph-database-and-its-visualization-with-neptune/" class="image featured">
                      <img class="h-full w-full object-cover object-center mb-6 border border-solid" src="https://mingjungyu.files.wordpress.com/2022/12//screenshot-2022-12-16-at-8.56.44-pm.png" alt="">
                    </a>
                
            

                <article class="prose prose-slate">
                <p>Amazon Neptune Graph Database and Data Visualization is the topic we want to research in this cross-ream collaboration in our company.</p>
<h2 id="introduction">Introduction</h2>
<p>We have a special scrum sprint called Innovative Idea Research every 3 months in our company, in this sprint, software engineers can choose the topics they have interesting to do research and show the result in last demo day.</p>
<p>The company proposed the new rule allows us can collaborate with members from other team on same research for improving the cross-team communication and increase the research diversity.</p>
<p>I saw many different cards on the board and there is a interesting name on one card.</p>
<blockquote>
<p>Neptune this name looks very cool, then &ldquo;Visualization&rdquo; might represent there will be some front-end skill included. I learned front-end since this year April and have some interesting with it.</p>
</blockquote>
<p>So I filled my name on the card, then we begin the collaboration with 1 member from another team and 1 member in same team but haven&rsquo;t had collaboration before.</p>
<p>I like this experience, it look like I leave the comfortable zone, and have more new experience with cross-team collaboration and new technology. I would like to extract some content from our original research note to here.</p>
<br>
<h2 id="objective">Objective</h2>
<p>Our research topic is <code>Research on Amazon Neptune and Data Visualization</code>.</p>
<p>This AWS service has been used for long while in the member who from another team, but me and my team member, we have 0 experience for it, and we need to learn even graph database and both AWS Neptune service in 2-3 weeks.</p>
<p>The table of content as following:</p>
<ul>
<li>Learn Basic Knowledge of Graph Database
<ul>
<li>NoSQL</li>
<li>Nodes, Edges, Label, Properties</li>
<li>Query Language: Gremlin</li>
<li>Relational Database(RDB) VS Graph Database(Graph DB)</li>
</ul>
</li>
<li>Implementation Part
<ul>
<li>Create Amazon Neptune Database + Jupyter Notebook</li>
<li>Use Gremlin to do simple query</li>
<li>Data Visualization
<ul>
<li>aws/graph-notebook</li>
<li>G.V()</li>
<li>Gremlify</li>
</ul>
</li>
</ul>
</li>
</ul>
<p>Are you ready?</p>
<br>
<h2 id="basic-knowledge">Basic Knowledge</h2>
<p>The following concepts can help you roughly understand Graph Database.</p>
<ul>
<li>NoSQL</li>
<li>Nodes, Edges, Label, Properties</li>
<li>Query Language</li>
<li>Relational Database(RDB) VS Graph Database(Graph DB)</li>
</ul>
<br>
<h3 id="nosql">NOSQL</h3>
<p>Graph Database is a NoSQL database, unlike relational database, such as MySQL, PostgreSQL, SQLite, they are different and not each service suit the Relational Database(RDBMS).</p>
<table>
<thead>
<tr>
<th></th>
<th>Type</th>
<th>Example</th>
</tr>
</thead>
<tbody>
<tr>
<td>NoSQL</td>
<td>Key-Value</td>
<td>Redis</td>
</tr>
<tr>
<td></td>
<td>Document-based</td>
<td>MongoDB</td>
</tr>
<tr>
<td></td>
<td>Column-based</td>
<td>BigTable</td>
</tr>
<tr>
<td></td>
<td>Graph-based</td>
<td>Neptune, Neo4j</td>
</tr>
<tr>
<td>RDBMS</td>
<td>Table-based</td>
<td>MySQL, PostgreSQL</td>
</tr>
</tbody>
</table>
<p>Through the above table, we can know the Graph DB is one of NoSQL DB.</p>
<br>
<h3 id="nodes-edges-label-and-property">Nodes, Edges, Label and Property</h3>
<p>Then we introduce the concepts of how Graph DB save data. If the nouns in RDB are Table, Column, Primery Key and Foreign Key，then in Graph DB there are Nodes, Edges, Label 和 Property.</p>
<table>
<thead>
<tr>
<th>Object</th>
<th>Description</th>
</tr>
</thead>
<tbody>
<tr>
<td>Nodes</td>
<td>Represent entities like company, people, account, this is roughly the equivalent of a record or row in relational database.</td>
</tr>
<tr>
<td>Edges</td>
<td>Like the relationship or connection between nodes, this is the key concept in graph database.</td>
</tr>
<tr>
<td>Label</td>
<td>Attribute that group similar nodes together, for example different company nodes belong to <strong>Label Company</strong>, like Google, Tesla, Apple, they are different <strong>Nodes</strong> but belong to <strong>Label called Company</strong>. so you can use like <em><strong>g.V().hasLabel(&ldquo;Company&rdquo;)</strong></em> to get all company Nodes.</td>
</tr>
<tr>
<td>Properties</td>
<td>Such as the properties which nodes or edges have, for example, if one company is a node, there might have employees count, founded date or location properties. Also, you can add property in Edge.</td>
</tr>
</tbody>
</table>
<p>Graph Database is more suitable for the data have highly complicated relationship.</p>
<br>
<h3 id="query-langauge-gremlin">Query Langauge: Gremlin</h3>
<p>The relation of Query language and Database like SQL and MySQL. In Graph DB, there are many query language, like Gremlin, Cypher, GQL, SPARQL, PGQL, GraphQL.</p>
<p>Sample:</p>
<table>
<thead>
<tr>
<th>Query Language</th>
<th>Statement</th>
</tr>
</thead>
<tbody>
<tr>
<td>SQL</td>
<td>SELECT * FROM table_name</td>
</tr>
<tr>
<td>Gremlin</td>
<td>g.V().hasLabel(label_name)</td>
</tr>
</tbody>
</table>
<p>In this research, we learn Gremlin and use it on AWS Neptune and Jupyter Notebook.</p>
<p>The following is the Cheat Sheet</p>
<pre tabindex="0"><code class="language-Gremlin" data-lang="Gremlin">%%Gremlin

// list all Nodes
g.V()

// list Nodes with limit 25 records
g.V().limit(25)

// list all Edges
g.E()

// list all Nodes and its value
g.V().valueMap()

// list all Nodes with its ID and its value
g.V().valueMap(true)

// list all Edges and its value
g.E().valueMap(true)

// Delete all Nodes &lt;-- This dangerous query must teach haha, careful to use.
g.V().drop().iterate()

// Delete all Edges 
g.E().drop().iterate()

// Add one Node
g.V().add(&#34;Company&#34;)

// Add one Node and its Property
g.V().add(&#34;Company&#34;).property(id, &#34;COM-0001&#34;).property(&#34;name&#34;, &#34;Innova&#34;).as(&#34;COM-0001&#34;)
g.V().add(&#34;Employee&#34;).property(id, &#34;EMP-0001&#34;).property(&#34;name&#34;, &#34;Mina&#34;).as(&#34;EMP-0001&#34;)

// Add Edge and Property (fill with Node Id)/and addE(the name of relationship): connect employee -&gt; company
g.V(&#34;EMP-0001&#34;).addE(&#34;belong&#34;).to(__.V(&#34;COM-0001&#34;)).property(&#34;checkIn&#34;, &#34;2022-02-14&#34;)

// Add data continuously: only the last query don&#39;t need to put next()
g.V().add(&#34;Company&#34;).property(id, &#34;COM-0001&#34;).property(&#34;name&#34;, &#34;Innova&#34;).as(&#34;COM-0001&#34;).next()
g.V().add(&#34;Company&#34;).property(id, &#34;COM-0002&#34;).property(&#34;name&#34;, &#34;Google&#34;).as(&#34;COM-0002&#34;).next()
g.V().add(&#34;Company&#34;).property(id, &#34;COM-0003&#34;).property(&#34;name&#34;, &#34;Tesla&#34;).as(&#34;COM-0003&#34;)

// Query same Label Node
g.V().hasLabel(&#34;Company&#34;)

// Query specific ID Node/Edge
g.V(&#34;COM-0001&#34;)
g.E(&#34;&lt;id&gt;&#34;)
</code></pre><p>More can refer other articles.</p>
<br>
<h3 id="relational-databaserdb-vs-graph-databasegraph-db">Relational Database(RDB) VS Graph Database(Graph DB)</h3>
<table>
<thead>
<tr>
<th></th>
<th>Graph DataBase</th>
<th>Relational Database</th>
</tr>
</thead>
<tbody>
<tr>
<td>Format</td>
<td>Nodes, Edges</td>
<td>Tables with Rows and Columns</td>
</tr>
<tr>
<td>Relationship</td>
<td>Considered data, represented by edges between nodes</td>
<td>Related across tables, established using foreign keys between tables.</td>
</tr>
<tr>
<td>Complex Query</td>
<td>Run quickly and do not require joins</td>
<td>Require complex joins between tables</td>
</tr>
<tr>
<td>Top Use Case</td>
<td><ul><li>Relationship-heavy use cases, including fraud detection and recommendation engines.</li> <li>Highly-connected data that comes with an intrinsic need for relationship analysis.</li> <li>Data model is inconsistent and demands frequent changes.</li> </ul></td>
<td><ul><li>Transaction-focused use cases, including online transactions and accounting. </li></ul></td>
</tr>
<tr>
<td>Example</td>
<td><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-14-at-11.14.47-am.png" alt=""></td>
<td><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-14-at-11.15.00-am.png" alt=""></td>
</tr>
<tr>
<td>Pros</td>
<td><ul><li>Addtional attribute could be added at some point.</li> <li>Not all entities will have all the attribute in the table. </li><li>The attribute types are not strictly defined. </li></ul></td>
<td><ul><li>it is faster when handling huge numbers of records because the structure of the data is known ahead of time. </li><li>Relational database in tables with rows and columns and uses <code>JOIN</code> for fast querying. </li></ul></td>
</tr>
<tr>
<td>Cons</td>
<td><ul><li>Run frequent table scans and searches for data that fits defined categories.</li> <li>When you have a known key and need to retrieve the data associated with it, a graph database is not particularly useful. </li><li>If the entities in your model have very large attributes like BLOBs, CLOBs, long texts&hellip; then graph databases aren&rsquo;t the best solution. </li></ul></td>
<td><ul><li>Relational databases are slower for large datasets.</li> <li>Relational database has poor performance for deep analytics. </li></ul></td>
</tr>
</tbody>
</table>
<p>Reference: <a href="https://www.techtarget.com/searchdatamanagement/feature/Graph-database-vs-relational-database-Key-differences">https://www.techtarget.com/searchdatamanagement/feature/Graph-database-vs-relational-database-Key-differences</a></p>
<br>
<h2 id="implementation-part">Implementation Part</h2>
<p>After learn concepts, we need to do some exercise, there will be 3 parts inside:</p>
<ul>
<li>Create Amazon Neptune Database + Jupyter Notebook</li>
<li>Use Gremlin to operate data</li>
<li>Data Visualization</li>
</ul>
<p>That&rsquo;s GO!</p>
<br>
<h3 id="create-amazon-neptune-database--jupyter-notebook">Create Amazon Neptune Database + Jupyter Notebook</h3>
<p>I&rsquo;m not sure everyone want to use Amazon Neptune Database, because for me,</p>
<blockquote>
<p>It is little expensive :)</p>
</blockquote>
<p>At begining, I think I created a new AWS account and use the Free Tier Plan will not be charged, but I still be charged 40 USD in 2 months (acutaully I played it 2 weeks, but cross November and December.).</p>
<p>So weird, in second time, I only created Neptune Database, I haven&rsquo;t use it in few mins and I got charged again haha.</p>
<p>(40 USD in my country is expensive.)</p>
<p>I use the AWS console to create Neptune, not the AWS CLI, not the Terraform. So that&rsquo;s do it.</p>
<p>Enter your cute Amazon Dashoboard and type Neptune on Search Bar for entering Neptune.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-15-at-9.51.12-pm.png" alt=""></p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-15-at-9.51.39-pm.png" alt=""></p>
<p>Click three dots at the left side.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-15-at-9.53.20-pm.png" alt=""></p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-15-at-9.53.30-pm.png" alt=""></p>
<p>Click Database and click Create database.</p>
<br>
<p>In the setting part, be careful the Free Plan in AWS Neptune is the Engine options <code>Provisioned</code> + <code>db.t3.medium</code></p>
<p>Please check your region, make sure your region supports Neptune instance.</p>
<p>If you got Failed, please check in CloudWatch.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/image.png" alt=""></p>
<p>If you got same error, it might represent your region doesn&rsquo;t support the instance <code>db.t3.medium</code> , we can created DB in region <code>us-east-1</code>。</p>
<br>
<p>In Create database setting, <code>Engine options</code> please choose <code>Provisioned</code>, I tried <code>Serverless</code>, it is not belong to Free Plan scope.</p>
<p><code>Templates</code> choose <code>Development and Testing</code>，<code>DB instance size</code> choose <code>Buerstable classes</code>: <code>db.t3.medium</code>。</p>
<p><code>Connectivity</code> is more complex part, it has permission problem and need to research the VPC part, I use the root user, so I have all permission, I suggest to call the helping from the MIS or DevOps, help to create Neptune Database directly.</p>
<p><code>Notebook configuration</code>，We need Jupyter Notebook to connect to Neptune and query data with it. so turn on the Create notebook.</p>
<p>After created, it will take some time to create DB and Notebook, you can check jupyter Notebook in Notebook section.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-15-at-10.12.15-pm.png" alt="">
<img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-15-at-10.12.24-pm.png" alt=""></p>
<p>Why the screenshot I provided is serverless? Because I told my company that I use my account to do research and be charged xD, they provide this Neptune for me to playing, so the Operator help me to create the Neptune directly, because I don&rsquo;t have permission.</p>
<blockquote>
<p>Remember stop the DB and Notebook when you don&rsquo;t use them.</p>
</blockquote>
<br>
<h3 id="use-gremlin-to-do-simple-operation">Use Gremlin to do simple operation</h3>
<p>Next step, please open the Notebook，we will use Gremlin to put some data.</p>
<p>First, that us check the database.</p>
<pre tabindex="0"><code>// Remember put this in AWS Jupyter Notebook, mark the next query need to use Gremlin to run 
%%gremlin

// list all Nodes
g.V()
</code></pre><p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-16-at-8.16.24-pm.png" alt=""></p>
<p>Because I have put some data inside it, or the database should empty if just created.</p>
<p>That&rsquo;s add some data, we add 2 Nodes.</p>
<pre tabindex="0"><code>%%gremlin

g.addV(&#34;People&#34;).
     property(id,&#34;PPL-0001&#34;).
     property(&#34;name&#34;,&#34;Amy&#34;).
     property(&#34;age&#34;,29).
     property(&#34;gender&#34;,&#34;F&#34;,).
     property(&#34;job&#34;,&#34;Engineer&#34;).
     as(&#34;PPL-0001&#34;).next()

g.addV(&#34;People&#34;).
     property(id,&#34;PPL-0002&#34;).
     property(&#34;name&#34;,&#34;Jason&#34;).
     property(&#34;age&#34;, 31).
     property(&#34;gender&#34;,&#34;M&#34;,).
     property(&#34;job&#34;,&#34;Salesmen&#34;).
     as(&#34;PPL-0002&#34;)
</code></pre><p>Now, we have 2 Nodes (2 People) belong to Label People, there are Properties id, name, gender and job, Amy and Jason.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-16-at-8.29.25-pm.png" alt=""></p>
<p>Then use <code>g.V()</code> to lise all Node, you can see the id PPL-0001 and PPL-0002 are the Nodes we just inserted.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-16-at-8.29.47-pm.png" alt=""></p>
<p>Then if you want to see the properties.</p>
<pre tabindex="0"><code>g.V().valueMap(true)
</code></pre><p>List all Nodes and its properties.</p>
<br>
<p>Then, we are gonna to add spme relationship by using Edge.</p>
<p>I want to present that Amy lile Jason since 2022/8</p>
<pre tabindex="0"><code>%%gremlin

// PPL-0001 Amy add one Edge like -&gt; PPL-0002 Jason
g.V(&#39;PPL-0001&#39;).addE(&#39;like&#39;).to(__.V(&#39;PPL-0002&#39;))
</code></pre><p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-16-at-8.31.13-pm.png" alt=""></p>
<p>We can see the Edge now.</p>
<p>So now we have 2 Nodes and 1 Edge.</p>
<ul>
<li>PPL-0001</li>
<li>PPL-0002</li>
<li>PPL-0001-like-&gt;PPL-0002</li>
</ul>
<br>
<p>But now each data present by words, it&rsquo;s hard to see, so now we are gonna to introduce Data Visualization.</p>
<br>
<h3 id="data-visualization">Data Visualization</h3>
<p>In our research, we took the research on three methods for Data Visualization of Graph Database, 2 of them are tools and not really need to install DB, so if you want to play Graph DB and Gremlin, here will introduce 2 methods.</p>
<ul>
<li><a href="https://github.com/aws/graph-notebook">aws/graph-notebook</a></li>
<li><a href="https://gdotv.com/">G.V()</a></li>
<li><a href="https://gremlify.com/">Gremlify</a></li>
</ul>
<br>
<h4 id="awsgraph-notebook">aws/graph-notebook</h4>
<p><a href="https://github.com/aws/graph-notebook">aws/graph-notebook</a> is a Python Package used in Jupyter Notebook, we use this in our implementation part. It has been included in Jupyter Notebook when created.</p>
<p>We researched one query sentence can show the data by graph.</p>
<pre tabindex="0"><code>%%gremlin -p v,ine,outv,oute,inv
g.V().or(hasLabel(&#34;&lt;Label1&gt;&#34;), hasLabel(&#34;&lt;Label2&gt;&#34;))
     .inE().outV()
     .outE().inV().path().by(valueMap(true))
</code></pre><p>Use this query and then fill up the Label data you want to show, you can touch it.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-16-at-8.32.25-pm.png" alt=""></p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-16-at-8.32.39-pm.png" alt=""></p>
<p>So, this is the data we just inserted, you can see the properties by press the three line icon.</p>
<p>If you want to find key words in any Nodes or Edges, you can use the search bar, like the screenshot showed.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-16-at-8.33.09-pm.png" alt=""></p>
<br>
<p>About the data visualization, I didn&rsquo;t put many data in the above description, so can not show more, let me show some mock data in our research, these all are mock data, will not involve our company.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-16-at-8.34.26-pm.png" alt=""></p>
<p>We use same query but with different Label name which the data I have inserted before.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-16-at-8.34.39-pm.png" alt=""></p>
<p>Well, I think the naming of Edges is not good, it looks little mess haha.</p>
<p>Use search bar to search key words will show the related Nodes and Edges.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-16-at-8.36.02-pm.png" alt=""></p>
<p>So that&rsquo;s all the content about using <code>aws/graph-notebook</code>.</p>
<br>
<h4 id="gv">G.V()</h4>
<p>That&rsquo;s introduce <a href="https://gdotv.com/">G.V()</a> which provided by AWS, <a href="https://docs.aws.amazon.com/neptune/latest/userguide/notebooks-visualization-tools.html">the third-party software</a> to realize the data visualization.</p>
<p><img src="https://mingjungyu.files.wordpress.com/2022/12/screenshot-2022-12-16-at-8.49.43-pm.png" alt=""></p>
<p>It is downloaded to the local in computer and includes the version Windows/Mac/Linux.</p>
<p>This software likes the MySQL WorkBrach, it allows we create a playground without any connection with any DB and then we can play Gremlin and GraphDB inside this playground.</p>
<p>There is always a button can show the graph when you do query, so it is very easy and convenient.</p>
<p>However, we stopped the research, because of the following reasons:</p>
<ul>
<li>If we want to connect to DB, it needs Pro version, which means we need to pay, we don&rsquo;t have budget to buy, and we would like to connect Neptune originally not only play win playground feature.</li>
<li>I found after addE, the existing all Nodes will disappear, I&rsquo;m not sure the bugs, this will increase more resarch time, due to the time limitation, we stopped the research.
<br></li>
</ul>
<h4 id="gremlify">Gremlify</h4>
<p>The finall tool is website, don&rsquo;t need to install and it is free, if you don&rsquo;t have requirement to install DB and just want to try, you can use this. -&gt; <a href="https://gremlify.com/">Gremlify</a>，I haven&rsquo;t use it, but I saw our another member showed this, and seems very convenient.</p>
<p>I don&rsquo;t have screenshot can show, this website allows you use mouse to create Node and Edge directly and not need to write query sentence, I think this is more convenient, and it also have visualization graph when you do query.</p>
<p>If anyone use it and feel good, please leave comment to me, thankt you!</p>
<br>
<p>Alright, that&rsquo;s all the research note of our cross-team collaboration Innovative Idea Research. This time I collaborate with 1 member from another team and 1 member who is same team with me but neven collaborate before (she is QE, and we run pair programming), and this technology is totally new for us, this is a very good experience for me, so I would like to write it down.</p>
<p>Espicially when collaborating, we know the member from another team will leave company after 1 month, this will be the first time and also final time we have collaboration, we should hold this opptunity to perform well, to do great job and create good memory and present good result in final.</p>
<br>
<p>This is my first time to write English article after a long while, I believe my English improved a lot since I&rsquo;m working in a Indian company located in Taiwan and having American business collaboration teams.</p>
<p>If you like or if there are some question/some errors in this article, please leave comment or send mail to me, thanks :).</p>
              </article>
              </div>
  
              
              <div class="mt-20 mb-10 border border-solid py-4">
                <p class="font-bold text-center text-gray grid-subtitle text-md font-fondamento px-4">Comment Board</p>
              </div>
  
              <div class="mb-10 border border-solid p-4">
                <details> 
                
                <summary class="font-bold text-center text-gray grid-subtitle text-md font-fondamento px-4 pb-2 cursor-pointer blog-link-style">Click to expand comment board!</summary>
                
    <article class="post">
        <div id="disqus_thread"></div>
<script type="application/javascript">
    window.disqus_config = function () {
    
    
    
    };
    (function() {
        if (["localhost", "127.0.0.1"].indexOf(window.location.hostname) != -1) {
            document.getElementById('disqus_thread').innerHTML = 'Disqus comments not available by default when the website is previewed locally.';
            return;
        }
        var d = document, s = d.createElement('script'); s.async = true;
        s.src = '//' + "minayu" + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="https://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
    </article>

                </details>
              </div>
  
  
            </div>
            </div>
              
            <div class="lg:w-1/3 w-full lg:h-auto lg: mt-6 lg:mt-0">
          <div class="px-4">
          
          <div>
    <div class="mb-10 border border-solid py-4">
                    <p class="font-bold text-center text-gray grid-subtitle text-md">ABOUT ME</p>
                </div>
                <div class="flex items-center justify-center">
                <img class="object-cover rounded-full" width="175" height="175" src="/img/logo.jpg" alt="Author Profile"/>
                </div>
                <p class="leading-relaxed text-md text-center pt-3 pb-3 px-2 motto-block">
                    Hi, this is Mina, an ENTP type person always with innovative ideas. Cheerful, lively, also romantic. A software engineer, blogger, love to explore different cultures and build entrepreneurship. 
                    </p>
                    <p class="leading-relaxed text-2xl text-center pt-1 pb-4 motto-block">
                    @MinaYu Signed
                    </p>

            
            
                
            

            <div class="border border-solid py-4">
                <p class="font-bold text-center text-gray grid-subtitle text-md">BLOG STATS</p>
            </div>
            
                <div class="my-5 pl-5 font-bold font-voll">
                    <span id="busuanzi_container_site_pv">
                        <p class="pb-2">Visits: <span id="busuanzi_value_site_pv"></span></p>
                    </span>
                    <span id="busuanzi_container_site_uv">
                        <p>Visitors: <span id="busuanzi_value_site_uv"></span></p>
                    </span>
                </div>
            </div>

  
          <div class="mb-5 border border-solid py-4">
              <p class="font-bold text-center text-gray grid-subtitle text-md">CATEGORY</p>
          </div>

          
  
  
    
    
      
      
        
        
        
        
        
          
          
          
        
        
        
      
        
          
        
        
        
        
        
          
          
          
        
        
        
      
      
    
  
    
    
      
      
        
        
        
        
        
          
          
        
        
        
      
        
        
        
        
        
          
          
            
            
            
          
        
        
        
      
      
    
  
    
    
      
      
        
        
        
        
        
          
          
        
        
        
      
        
        
        
        
        
          
          
            
            
            
          
        
        
        
      
      
    
  
    
    
      
      
        
        
        
        
        
          
          
        
        
        
      
        
        
        
        
        
          
          
          
        
        
        
      
      
    
  
    
    
      
      
        
        
        
        
        
          
          
        
        
        
      
        
        
        
        
        
          
          
            
            
            
          
        
        
        
      
      
    
  
    
    
      
      
        
        
        
        
        
          
          
        
        
        
      
        
        
        
        
        
          
          
            
            
            
          
        
        
        
      
      
    
  
    
    
      
      
        
        
        
        
        
          
          
          
        
        
        
      
        
        
        
        
        
          
          
          
        
        
        
      
      
    
  
    
    
      
      
        
        
        
        
        
          
          
        
        
        
      
        
        
        
        
        
          
          
            
            
            
          
        
        
        
      
      
    
  
    
    
      
      
        
        
        
        
        
          
          
        
        
        
      
        
        
        
        
        
          
          
            
            
            
          
        
        
        
      
      
    
  


          <div>
            
              
                
                <div id="posts-list-espa%C3%B1ol-posts" data-category="Español Posts" data-parent-categories="">
                  <a href="https://minayu.site/en/categories/espa%C3%B1ol-posts" class="blog-link-style">
                    <div class = "py-3 text-sm border-b border-solid font-fondamento">Español Posts
                    <span class="font-color-gold-1">(2)</span>
                    </div>
                  </a>

                  <div>
                    
                      
                      
                        

  <div id="posts-list-novel-historia-somos-familia" data-category="[Novel] [Historia] Somos familia" data-parent-categories="espa%C3%B1ol-posts">
  <a href="https://minayu.site/en/categories/novel-historia-somos-familia">
    <div class="py-3 pl-6 text-sm border-b border-solid font-color-black-1 font-fondamento">[Novel] [Historia] Somos familia 
      <span class="font-color-gold-1">(2)</span>
    </div>
  </a>
  
  
  
  </div>


                      
                        


                      
                        


                      
                    
                  </div>
                </div>
              
                
                <div id="posts-list-it-things-and-development" data-category="IT Things and Development" data-parent-categories="">
                  <a href="https://minayu.site/en/categories/it-things-and-development" class="blog-link-style">
                    <div class = "py-3 text-sm border-b border-solid font-fondamento">IT Things and Development
                    <span class="font-color-gold-1">(7)</span>
                    </div>
                  </a>

                  <div>
                    
                      
                      
                        


                      
                        

  <div id="posts-list-back-end-10000-hours-plan-of-being-back-end-developer" data-category="[Back-end] 10000 hours - Plan of being Back-end Developer" data-parent-categories="it-things-and-development">
  <a href="https://minayu.site/en/categories/back-end-10000-hours-plan-of-being-back-end-developer">
    <div class="py-3 pl-6 text-sm border-b border-solid font-color-black-1 font-fondamento">[Back-end] 10000 hours - Plan of being Back-end Developer 
      <span class="font-color-gold-1">(4)</span>
    </div>
  </a>
  
  
  
  </div>


                      
                        

  <div id="posts-list-start-up-diary-miri-robot-fortune-teller-making-product-is-not-easy" data-category="[Start-Up Diary] Miri Robot Fortune Teller - Making Product Is Not Easy!" data-parent-categories="it-things-and-development">
  <a href="https://minayu.site/en/categories/start-up-diary-miri-robot-fortune-teller-making-product-is-not-easy">
    <div class="py-3 pl-6 text-sm border-b border-solid font-color-black-1 font-fondamento">[Start-Up Diary] Miri Robot Fortune Teller - Making Product Is Not Easy! 
      <span class="font-color-gold-1">(3)</span>
    </div>
  </a>
  
  
  
  </div>


                      
                    
                  </div>
                </div>
              
            
            </div>

  
          <div class="mb-10 border border-solid py-4 mt-10">
              <p class="font-bold text-center text-gray grid-subtitle text-md">GALLERY</p>
          </div>
  
          </div>
            </div>
          </div>
  
  
        </div>
      </div>
  
  
    
    </div>
  </section>
  
  
  <footer>
    <div class="bg-white border-t border-solid">
      <div class="container px-5 mx-auto">
        <div class="xl:w-1/2 lg:w-3/4 w-full mx-auto text-center">
      <div class="text-gray-600 text-center text-xl font-hand-writing tracking-wider py-8 px-2">
        Hi, It's Mina Yu, a software engineer, blogger and polyglot learner. Since 7-9 years ago, 
        my dream is designing my own personal website and now I did it, 
        I changed the website name to @Mina Influence, want to encourage people by my influence.
        I will continue to achieve more my dream in the future.
        I just want to tell you, no matter your plan looks how hard and how unachievable, 
        Once you begin to do it, everything will be changed.
      </div>
      </div>
      </div>
    </div>
    <div class="bg-cyan-50 border-t border-solid">
      <div class="text-gray-300 text-center text-md motto-block py-8 px-4">
        Copy Right © 2022 @Mina Influence. Designed by MINA YU. Sign @MinaYu.
      </div>
    </div>
</footer>

</body>
</html>

  </div>
